module.exports.config = {
  name: "emojiAuto",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "Piyush",
  description: "Auto reply to emojis",
  commandCategory: "auto",
  usages: "Auto emoji reply",
  cooldowns: 1
};

module.exports.handleEvent = async function ({ api, event }) {
  const emojiReplies = {
    "😂": "हाहा! मजेदार था बेबी हस मत दांत डोर दूंगी पागल समझता है क्या 😄",
    "❤️": "लव यू टू मेरी जान हाय ये दिल तुमको दिया ये भी ना पूछा कौन हो तुम 💖",
    "🥺": "ओह नो... क्या हुआ बेबी आपको कोई दिकत हो रहा क्या जानू ? 🥺💔",
    "👍": "शाबाश मेरे फिगर के दीवाने जब देखो अंगूठा मत दिखाओ ! 👍",
    "🔥": "बिलकुल आग है बबाल हो तू ! 🔥",
    "😡": "किस पर गुस्सा है बेबी मैं तो डर गया तेरे प्यार मे गिर गया ? 😠",
    "🙏": "धन्यवाद जी राम राम 🖤राधे राधे जी सुक्रिया 🙏"
    "🙄": "𝗛𝗔𝗬 𝗜𝗦𝗘 𝗨𝗣𝗔𝗥 𝗞𝗬𝗨 𝗗𝗘𝗞𝗛 𝗥𝗔𝗛𝗔 𝗛𝗔𝗜 𝗜𝗦𝗘 𝗠𝗔𝗧 𝗗𝗘𝗞𝗛𝗢 𝗞𝗔𝗛𝗜 𝗣𝗬𝗔𝗥 𝗡𝗔 𝗛𝗢 𝗝𝗔𝗬𝗘 𝗠𝗘𝗥𝗘 𝗕𝗢𝗦𝗦 𝗔𝗬𝗨𝗦𝗛 𝗦𝗘 😂"
  };

  const message = event.body;
  if (!message) return;

  for (const emoji in emojiReplies) {
    if (message.includes(emoji)) {
      return api.sendMessage(emojiReplies[emoji], event.threadID, event.messageID);
    }
  }
};

module.exports.run = async function () {
  // Command manually run नहीं होती, ये auto reply है
};
